package com.tianxing.model;

/**
 * Created by tianxing on 16/7/22.
 * 联系人操作接口
 */
public interface ContactsPool {


    /**
     * 取得群组数目
     * */

    /**
     * 取得对应位置的一个群主信息
     * */

    /**
     * 取得群组列表
     * */

    /**
     * 向群组列表中添加一个群主信息
     * */




    /**
     * 取得好友数目
     * */


    /**
     * 取得好友列表
     * */


    /**
     * 取得对应位置的一个好友信息
     * */




    /**
     * 取得班级数目
     * */


    /**
     * 取得对应位置的班级信息
     * */

    /**
     * 取得对应位置班级的学生数目
     * */

    /**
     * 取得对应位置的班级中的学生信息
     * */

    /**
     * 取得对应位置的班级的学生列表
     * */



}
